Tekla Open API Reference for Tekla Structures 2025
CustomPartInputTypeAttribute Properties
The CustomPartInputTypeAttribute type exposes the following members.
Properties
Name | Description
Type
 The custom attribute uses this to store the input type to the system. This is not to be used by itself.
Top
See Also
Reference
CustomPartInputTypeAttribute Class
Tekla.Structures.Plugins Namespace